In [1]:
import pandas as pd

In [2]:
import numpy as np

In [5]:
l = [10, 20, 30]
label = ['x', 'y', 'z']

In [6]:
series = pd.Series(data = l, index = label)
series

x    10
y    20
z    30
dtype: int64

In [7]:
arr = np.array(l)

In [8]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [9]:
data_set = { 'x' : 10, 'y':20, 'z':30 }
pd.Series(data_set)

x    10
y    20
z    30
dtype: int64

In [10]:
countryPop = pd.Series(['1.5M', '2M', '6M', '10M'], index = ['USA', 'Japan', 'India', 'Italy'])
countryPop

USA      1.5M
Japan      2M
India      6M
Italy     10M
dtype: object

In [12]:
countryPop['India']

'6M'

### Dataframe

In [13]:
from numpy.random import randn

In [14]:
df = pd.DataFrame(randn(6,5), index=['a','b','c','d','e','f'], columns = ['col1', 'col2', 'col3', 'col4', 'col5'] )

In [15]:
df

       col1      col2      col3      col4      col5
a  0.802484 -1.341176  0.126129  0.925566  0.079453
b -0.520222  1.011722 -0.020256 -0.239429 -1.356958
c  0.713877  0.402437  1.105897 -0.570112 -0.428831
d -1.177914  1.029414  1.782254  0.469737 -0.259328
e -1.018836 -0.054572  1.270286 -1.045720 -1.955326
f  0.565734 -0.147409  0.570622  0.802046 -0.336113

In [16]:
df['col2']

a   -1.341176
b    1.011722
c    0.402437
d    1.029414
e   -0.054572
f   -0.147409
Name: col2, dtype: float64

In [17]:
df[ ['col2', 'col5'] ]

       col2      col5
a -1.341176  0.079453
b  1.011722 -1.356958
c  0.402437 -0.428831
d  1.029414 -0.259328
e -0.054572 -1.955326
f -0.147409 -0.336113

In [18]:
df.col2

a   -1.341176
b    1.011722
c    0.402437
d    1.029414
e   -0.054572
f   -0.147409
Name: col2, dtype: float64

In [19]:
type(df.col2)

pandas.core.series.Series

In [20]:
df

       col1      col2      col3      col4      col5
a  0.802484 -1.341176  0.126129  0.925566  0.079453
b -0.520222  1.011722 -0.020256 -0.239429 -1.356958
c  0.713877  0.402437  1.105897 -0.570112 -0.428831
d -1.177914  1.029414  1.782254  0.469737 -0.259328
e -1.018836 -0.054572  1.270286 -1.045720 -1.955326
f  0.565734 -0.147409  0.570622  0.802046 -0.336113

In [21]:
df['col6'] = df['col2'] + df['col5']

In [22]:
df

       col1      col2      col3      col4      col5      col6
a  0.802484 -1.341176  0.126129  0.925566  0.079453 -1.261723
b -0.520222  1.011722 -0.020256 -0.239429 -1.356958 -0.345236
c  0.713877  0.402437  1.105897 -0.570112 -0.428831 -0.026393
d -1.177914  1.029414  1.782254  0.469737 -0.259328  0.770086
e -1.018836 -0.054572  1.270286 -1.045720 -1.955326 -2.009897
f  0.565734 -0.147409  0.570622  0.802046 -0.336113 -0.483522

In [23]:
df_deleted_col6 = df.drop('col6', axis=1)
df_deleted_col6

       col1      col2      col3      col4      col5
a  0.802484 -1.341176  0.126129  0.925566  0.079453
b -0.520222  1.011722 -0.020256 -0.239429 -1.356958
c  0.713877  0.402437  1.105897 -0.570112 -0.428831
d -1.177914  1.029414  1.782254  0.469737 -0.259328
e -1.018836 -0.054572  1.270286 -1.045720 -1.955326
f  0.565734 -0.147409  0.570622  0.802046 -0.336113

In [24]:
df

       col1      col2      col3      col4      col5      col6
a  0.802484 -1.341176  0.126129  0.925566  0.079453 -1.261723
b -0.520222  1.011722 -0.020256 -0.239429 -1.356958 -0.345236
c  0.713877  0.402437  1.105897 -0.570112 -0.428831 -0.026393
d -1.177914  1.029414  1.782254  0.469737 -0.259328  0.770086
e -1.018836 -0.054572  1.270286 -1.045720 -1.955326 -2.009897
f  0.565734 -0.147409  0.570622  0.802046 -0.336113 -0.483522

In [ ]:
df_deleted_col6 = df.drop('col6', axis=1, inplace=True) # inplace True dile, original data frame theika column delete hoibo, or else hoitona
df_deleted_col6

In [28]:
df

       col1      col2      col3      col4      col5
a  0.802484 -1.341176  0.126129  0.925566  0.079453
b -0.520222  1.011722 -0.020256 -0.239429 -1.356958
c  0.713877  0.402437  1.105897 -0.570112 -0.428831
d -1.177914  1.029414  1.782254  0.469737 -0.259328
e -1.018836 -0.054572  1.270286 -1.045720 -1.955326
f  0.565734 -0.147409  0.570622  0.802046 -0.336113

In [31]:
df.drop('f', axis=0) # axis 0 hoise index value, R 1 hoise column value

       col1      col2      col3      col4      col5
a  0.802484 -1.341176  0.126129  0.925566  0.079453
b -0.520222  1.011722 -0.020256 -0.239429 -1.356958
c  0.713877  0.402437  1.105897 -0.570112 -0.428831
d -1.177914  1.029414  1.782254  0.469737 -0.259328
e -1.018836 -0.054572  1.270286 -1.045720 -1.955326

In [32]:
df

       col1      col2      col3      col4      col5
a  0.802484 -1.341176  0.126129  0.925566  0.079453
b -0.520222  1.011722 -0.020256 -0.239429 -1.356958
c  0.713877  0.402437  1.105897 -0.570112 -0.428831
d -1.177914  1.029414  1.782254  0.469737 -0.259328
e -1.018836 -0.054572  1.270286 -1.045720 -1.955326
f  0.565734 -0.147409  0.570622  0.802046 -0.336113

In [33]:
df['col1']

a    0.802484
b   -0.520222
c    0.713877
d   -1.177914
e   -1.018836
f    0.565734
Name: col1, dtype: float64

In [34]:
df.loc['b']

col1   -0.520222
col2    1.011722
col3   -0.020256
col4   -0.239429
col5   -1.356958
Name: b, dtype: float64

In [38]:
df.iloc[1] # 'b' er index, 'c' er index 2

col1   -0.520222
col2    1.011722
col3   -0.020256
col4   -0.239429
col5   -1.356958
Name: b, dtype: float64

In [37]:
df.loc['c', 'col3']

1.105897278348501

In [39]:
df.loc[ ['a', 'b'], ['col2', 'col5'] ]

       col2      col5
a -1.341176  0.079453
b  1.011722 -1.356958

### selection based on conditions (boolean)

In [40]:
df

       col1      col2      col3      col4      col5
a  0.802484 -1.341176  0.126129  0.925566  0.079453
b -0.520222  1.011722 -0.020256 -0.239429 -1.356958
c  0.713877  0.402437  1.105897 -0.570112 -0.428831
d -1.177914  1.029414  1.782254  0.469737 -0.259328
e -1.018836 -0.054572  1.270286 -1.045720 -1.955326
f  0.565734 -0.147409  0.570622  0.802046 -0.336113

In [41]:
df > 0

    col1   col2   col3   col4   col5
a   True  False   True   True   True
b  False   True  False  False  False
c   True   True   True  False  False
d  False   True   True   True  False
e  False  False   True  False  False
f   True  False   True   True  False

In [42]:
df[ df>0 ]

       col1      col2      col3      col4      col5
a  0.802484       NaN  0.126129  0.925566  0.079453
b       NaN  1.011722       NaN       NaN       NaN
c  0.713877  0.402437  1.105897       NaN       NaN
d       NaN  1.029414  1.782254  0.469737       NaN
e       NaN       NaN  1.270286       NaN       NaN
f  0.565734       NaN  0.570622  0.802046       NaN

In [44]:
df

       col1      col2      col3      col4      col5
a  0.802484 -1.341176  0.126129  0.925566  0.079453
b -0.520222  1.011722 -0.020256 -0.239429 -1.356958
c  0.713877  0.402437  1.105897 -0.570112 -0.428831
d -1.177914  1.029414  1.782254  0.469737 -0.259328
e -1.018836 -0.054572  1.270286 -1.045720 -1.955326
f  0.565734 -0.147409  0.570622  0.802046 -0.336113

In [45]:
df[ df['col1'] > 0 ]

       col1      col2      col3      col4      col5
a  0.802484 -1.341176  0.126129  0.925566  0.079453
c  0.713877  0.402437  1.105897 -0.570112 -0.428831
f  0.565734 -0.147409  0.570622  0.802046 -0.336113

In [47]:
df[ df['col1'] > 0 ][['col4', 'col5']]

       col4      col5
a  0.925566  0.079453
c -0.570112 -0.428831
f  0.802046 -0.336113

In [48]:
df

       col1      col2      col3      col4      col5
a  0.802484 -1.341176  0.126129  0.925566  0.079453
b -0.520222  1.011722 -0.020256 -0.239429 -1.356958
c  0.713877  0.402437  1.105897 -0.570112 -0.428831
d -1.177914  1.029414  1.782254  0.469737 -0.259328
e -1.018836 -0.054572  1.270286 -1.045720 -1.955326
f  0.565734 -0.147409  0.570622  0.802046 -0.336113

In [51]:
df[ (df['col1']>0) & (df['col2']>0.1) ] # & --> ampersand

       col1      col2      col3      col4      col5
c  0.713877  0.402437  1.105897 -0.570112 -0.428831

## Extras on indexing

In [52]:
df

       col1      col2      col3      col4      col5
a  0.802484 -1.341176  0.126129  0.925566  0.079453
b -0.520222  1.011722 -0.020256 -0.239429 -1.356958
c  0.713877  0.402437  1.105897 -0.570112 -0.428831
d -1.177914  1.029414  1.782254  0.469737 -0.259328
e -1.018836 -0.054572  1.270286 -1.045720 -1.955326
f  0.565734 -0.147409  0.570622  0.802046 -0.336113

In [53]:
df.reset_index()

  index      col1      col2      col3      col4      col5
0     a  0.802484 -1.341176  0.126129  0.925566  0.079453
1     b -0.520222  1.011722 -0.020256 -0.239429 -1.356958
2     c  0.713877  0.402437  1.105897 -0.570112 -0.428831
3     d -1.177914  1.029414  1.782254  0.469737 -0.259328
4     e -1.018836 -0.054572  1.270286 -1.045720 -1.955326
5     f  0.565734 -0.147409  0.570622  0.802046 -0.336113

In [54]:
states = ['TR', 'AS', 'NG', 'KA', 'MZ', 'TN']

In [55]:
df['states'] = states

In [56]:
df

       col1      col2      col3      col4      col5 states
a  0.802484 -1.341176  0.126129  0.925566  0.079453     TR
b -0.520222  1.011722 -0.020256 -0.239429 -1.356958     AS
c  0.713877  0.402437  1.105897 -0.570112 -0.428831     NG
d -1.177914  1.029414  1.782254  0.469737 -0.259328     KA
e -1.018836 -0.054572  1.270286 -1.045720 -1.955326     MZ
f  0.565734 -0.147409  0.570622  0.802046 -0.336113     TN

In [59]:
df.set_index('states', inplace=True)

In [60]:
df

            col1      col2      col3      col4      col5
states
TR      0.802484 -1.341176  0.126129  0.925566  0.079453
AS     -0.520222  1.011722 -0.020256 -0.239429 -1.356958
NG      0.713877  0.402437  1.105897 -0.570112 -0.428831
KA     -1.177914  1.029414  1.782254  0.469737 -0.259328
MZ     -1.018836 -0.054572  1.270286 -1.045720 -1.955326
TN      0.565734 -0.147409  0.570622  0.802046 -0.336113

## Hierarchy & Multiple Index

In [61]:
ots = ['grp1', 'grp1', 'grp1', 'grp2', 'grp2', 'grp2']
ins = [1,2,3,1,2,3]
hierarchy_index = list(zip(ots, ins))
hierarchy_index = pd.MultiIndex.from_tuples(hierarchy_index)

In [62]:
hierarchy_index

MultiIndex([('grp1', 1),
            ('grp1', 2),
            ('grp1', 3),
            ('grp2', 1),
            ('grp2', 2),
            ('grp2', 3)],
           )

In [63]:
df = pd.DataFrame(np.random.randn(6,3), index = hierarchy_index, columns = ['col1', 'col2', 'col3'])

In [64]:
df

            col1      col2      col3
grp1 1  1.536204 -0.217742  0.440055
     2 -0.714073  1.285093 -1.306593
     3 -0.254242 -1.402529 -0.787831
grp2 1  0.028043  0.605172 -0.343250
     2 -2.652497  1.169120  0.354369
     3 -0.271978 -0.993982  0.636917

In [67]:
df.loc['grp1'].loc[2]

col1   -0.714073
col2    1.285093
col3   -1.306593
Name: 2, dtype: float64

In [68]:
df.loc['grp2'].loc[ 3, 'col3' ]

0.6369167816345122

In [69]:
df

            col1      col2      col3
grp1 1  1.536204 -0.217742  0.440055
     2 -0.714073  1.285093 -1.306593
     3 -0.254242 -1.402529 -0.787831
grp2 1  0.028043  0.605172 -0.343250
     2 -2.652497  1.169120  0.354369
     3 -0.271978 -0.993982  0.636917

In [70]:
df.index.names

FrozenList([None, None])

In [71]:
df.index.names = ['GROUPS', 'SUB-GROUPS']

In [72]:
df

                       col1      col2      col3
GROUPS SUB-GROUPS
grp1   1           1.536204 -0.217742  0.440055
       2          -0.714073  1.285093 -1.306593
       3          -0.254242 -1.402529 -0.787831
grp2   1           0.028043  0.605172 -0.343250
       2          -2.652497  1.169120  0.354369
       3          -0.271978 -0.993982  0.636917

In [73]:
df.loc['grp1']

                col1      col2      col3
SUB-GROUPS
1           1.536204 -0.217742  0.440055
2          -0.714073  1.285093 -1.306593
3          -0.254242 -1.402529 -0.787831

In [74]:
df.xs('grp1') # old method. not used now. some functions are depreciated

                col1      col2      col3
SUB-GROUPS
1           1.536204 -0.217742  0.440055
2          -0.714073  1.285093 -1.306593
3          -0.254242 -1.402529 -0.787831

## Handling Missing Data Points

In [84]:
df = pd.DataFrame( {
'col1' : [25,45, 5],
'col2' : [75,np.nan,87],
'col3' : [33, np.nan, 90]
    
} )

In [85]:
df

   col1  col2  col3
0    25  75.0  33.0
1    45   NaN   NaN
2     5  87.0  90.0

In [86]:
df.dropna() # row wise***

   col1  col2  col3
0    25  75.0  33.0
2     5  87.0  90.0

In [88]:
df.dropna(axis=1) # column wise

   col1
0    25
1    45
2     5

In [89]:
df.fillna(value = 'TANMOY')

   col1    col2    col3
0    25    75.0    33.0
1    45  TANMOY  TANMOY
2     5    87.0    90.0

In [90]:
df

   col1  col2  col3
0    25  75.0  33.0
1    45   NaN   NaN
2     5  87.0  90.0

In [91]:
df['col2'].fillna(value=df['col1'].mean())

0    75.0
1    25.0
2    87.0
Name: col2, dtype: float64